import '../../article/models/article_model.dart';

final List<Article> articleList = [
  Article(
    title: 'الشباب علم وعمل',
    imageUrl:
        'https://allonehealth.com/wp-content/uploads/2022/07/iStock-1358014313-scaled-1.jpg',
    id: 101,
    description:
        'شجعت المؤسسة منذ البداية على افتتاح فرع لجامعة غازي عنتاب في الشمال السوري لاستيعاب أعداد الطلاب المتزايدة، ومنحهم شهادات علمية معتمدة من جامعات حكومية تركية شجعت المؤسسة منذ البداية على افتتاح فرع لجامعة غازي عنتاب في الشمال السوري لاستيعاب أعداد الطلاب المتزايدة، ومنحهم شهادات علمية معتمدة من جامعات حكومية تركية كانت المؤسسة شريكاً رئيسياً في تأسيس جامعة حلب في المناطق المحررة، ولا تزال مستمرةً بالإشراف على الجامعة، وتقديم الدعم لها، والذي يتضمن تقديم المنح الشهرية للكوادر الإدارية والتدريسية والكلف التشغيلة، وتزويدها باحتياجاتها اللوجستية، فضلاً عن تجهيز وتقديم المخابر العلمية اللازمة كمخبر كلية الطب البشري والأسنان ومخبر الصيدلة والكيمياء، وافتتاح مكتبة الجامعة، بالإضافة لتقديم المنح الطلابية ودعم مشاريع تخرُّج الطلاب وعمل دورات التقوية لهم، والمساهمة في دعم وتأسيس مكتب الطلبة (هيئة طلاب جامعة حلب).',
  ),
  Article(
    title: 'الطفولة بناء وأمل',
    imageUrl:
        'https://allonehealth.com/wp-content/uploads/2022/07/iStock-1358014313-scaled-1.jpg',
    id: 102,
    description: 'تعمل المؤسسة على رعاية المدارس من خلال بناء المدارس وإنشاؤها',
  ),
  Article(
    title: 'مستقبل الشباب في سوق العمل',
    imageUrl:
        'https://www.un.org/sites/un2.un.org/files/styles/large-article-image-style-16-9/public/field/image/e5m5otexiaa1fvj.jpg',
    id: 103,
    description:
        'تعمل المؤسسة على تأهيل الشباب لدخول سوق العمل من خلال مشروع (1000) مبرمج',
  ),
  Article(
    title: 'رعاية المدارس',
    imageUrl:
        'https://www.understood.org/_next/image?url=https%3A%2F%2Fcdn-images.understood.org%2Fp0qf7j048i0q%2FE3C718B6580F40C3B5C7D8D1E86B4A6E%2Ff3dbff6e10f35df96a79d58b6039b954%2Fi499343530.jpg&w=3840&q=75',
    id: 104,
    description: 'تعمل المؤسسة على رعاية المدارس من خلال بناء المدارس وإنشاؤها',
  ),
];
