import '../../news/models/news_model.dart';

final List<News> newsList = [
  News(
      title: 'تدريب تعزيز التماسك المجتمعي',
      imageUrl:
          'https://marvel-b1-cdn.bc0a.com/f00000000268933/www.mhskids.org/wp-content/uploads/milton-hershey-school-students-in-classroom.jpg',
      id: 1,
      description:
          'بالتعاون بين #مؤسسة_تعليم_بلا_حدود – #مداد ومكتب الشباب في جامعة حلب يسرنا دعوتكم ضمن #حملة_رمضان_شباب_وارتقاء لحضور تدريب بعنوان:  تعزيز التماسك المجتمعي في سوريا الجديدةس ',
      time: '11:00 ظهرًا',
      date: 'يوم الخميس / 06 / 03 / 2025',
      location: 'المدينة الجامعية (الوحدة الرابعة عشر)',
      instructor: ' أحمد إسماعيل'),
  News(
    title: 'إعلان الانتساب لمشروع 1000 مبرمج',
    imageUrl:
        'https://cdn.seeklearning.com.au/media/images/career-guide/module/programmer.jpg',
    id: 2,
    description:
        'فرصة تدريبية جديدة وأمل جديد.. وتحت شعار #معاً_لنجعل_بلادنا_واحة_تقنية تشع بالأمل.. استمراراً لمسيرة النجاح التي بدأناها في المناطق المحررة سابقاً وبعد التحرير الكبير لبلادنا، يسرنا الإعلان عن بداية جديدة  لمشروع #1000 #مبرمج، حيث تعلن #مؤسسة_تعليم_بلا_حدود – #مداد بالتعاون مع #جامعة_حلب عن فتح باب المشاركة والانتساب للمشروع لطلاب جامعات #الشمال_السوري. و #مشروع_ألف_مبرمج هو برنامج تأهيلي متكامل، يسعى لرفع القدرات التخصصية في مجالات #لغات_البرمجة و #تطبيقات_الويب و #الجوال، وإكساب المنتسبين #المهارات_التسويقية واللغوية المناسبة، وهو مخصص هذه المرحلة لـ: طلاب السنة الثالثة فما فوق من كلية الهندسة المعلوماتية.',
    instructor: ' أحمد إسماعيل',
  ),
  News(
    title: 'مستقبل الشباب في سوق العمل',
    imageUrl:
        'https://www.un.org/sites/un2.un.org/files/styles/large-article-image-style-16-9/public/field/image/e5m5otexiaa1fvj.jpg',
    id: 3,
    description:
        'بالتعاون بين #مؤسسة_تعليم_بلا_حدود – #مداد ومكتب الشباب في جامعة حلب يسرنا دعوتكم ضمن #حملة_رمضان_شباب_وارتقاء لحضور محاضرة بعنوان:  مستقبل الشباب في سوق العمل مهارات وفرص للنجاح ',
    time: '11:00 ظهرًا',
    date: 'يوم الخميس / 06 / 03 / 2025',
  ),
];
